Revit 2027 API
BuiltInFailures.InfillFailures.CannotDeleteInfill Property
 Can't delete infilling element without deleting its insert or host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDeleteInfill { get; }
Public Shared ReadOnly Property CannotDeleteInfill As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDeleteInfill {
	FailureDefinitionId^ get ();
}
static member CannotDeleteInfill : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace